rhoCentralFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
     	(0 0 0)
        (.6 0 0)
        (0 .2 0)
        (.6 .2 0)
        (3 .2 0)
        (0 1 0)
        (.6 1 0)
        (3 1 0)
        (0 0 .1)
        (.6 0 .1)
        (0 .2 .1)
        (.6 .2 .1)
        (3 .2 .1)
        (0 1 .1)
        (.6 1 .1)
        (3 1 .1)
        

);

blocks
(
    //block 0
    hex (0 1 3 2 8 9 11 10) (20 20 1) simpleGrading (1 1 1)
    hex (2 3 6 5 10 11 14 13) (20 20 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (20 20 1) simpleGrading (1 1 1)

);

edges
(
    // fill in the details
    //none?
);

boundary
(
    inlet
    {
        type patch;
        faces
        (

        (5 13 10 2)
        (2 10 8 0)

        );
    }
    outlet
    {
        type patch;
        faces
        (

        (7 15 12 4)

        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
       
        // fill in the details
	    (0 8 9 1)

        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
       
        (5 13 14 6)
        (6 14 15 7)
	

        );
    }
    obstacle
    {
        type patch;
        faces
        (
       
        (3 11 9 1)
        (3 11 12 4)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
